app/Controllers/Customers.php

    public function index(): string
    {
        $customerModel = new CustomerModel();

        // Query Builder database retrieval[cite: 2]
        $data = [
            'title'     => 'Customer Accounts',
            'customers' => $customerModel->findAll()
---
SELECT *
FROM `customers`